app/views/items/show.html.erb

        <p>Rating Score:</p>
      <% if @item.ratings.present? %>
---
SELECT "ratings".* FROM "ratings" WHERE "ratings"."item_id" = ?  [["item_id", 1]]