app/controllers/items_controller.rb

SELECT "items".* FROM "items"
---
  def index
      #@items = Item.all
      @items = Item.paginate(:page => params[:page], :per_page => 5)

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."item_id" = ?  [["item_id", 1]]
SELECT "ratings".* FROM "ratings" WHERE "ratings"."item_id" = ?  [["item_id", 1]]
---
  def show
    @item = Item.find(params[:id])
    @review = @item.reviews.build
    @price = Price.where(item_id: @item.id).first
    @pictures = Picture.where(item_id: @item.id)

      if current_user
       @rating = current_user.ratings.find_by(:item => @item)