app/controllers/ratings_controller.rb

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 2]]
---
  def load_item
    item = params[:item_id]
    @item = Item.find(item)