app/views/reviews/_review.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 33]]
---
      <% if review.user != nil %>
        <em> Posted by <%= review.user.first_name %> Added on: <%= review.created_at %></em>